def area(a, b):
    """
    Возвращает площадь прямоугольника.
    
    Параметры:
        a (float): ширина прямоугольника
        b (float): высота прямоугольника
    
    Возвращаемое значение:
        area (float): площадь прямоугольника
    """
    return a * b

def perimeter(a, b):
    """
    Возвращает периметр прямоугольника.
    
    Параметры:
        a (float): ширина прямоугольника
        b (float): высота прямоугольника
    
    Возвращаемое значение:
        perimeter (float): периметр прямоугольника
    """
    return 2 * (a + b)
